config.org
#+TITLE
** Emoji
Set a keymap to insert emojis
#+BEGIN_SRC elisp :tangle yes
(global-set-key (kbd "<f12>") 'emojify-insert-emoji)
#+END_SRC




** Highlights and text decorations
#+BEGIN_SRC elisp :tangle yes
(add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
#+END_SRC


| highlight-indent-guides-mode | yas-minor-mode-on | hl-todo-mode | display-line-numbers-mode | highlight-numbers-mode | hl-line-mode | vi-tilde-fringe-mode |

*** Beacon mode
#+BEGIN_SRC elisp :tangle yes
(beacon-mode 1)
(setq beacon-blink-when-focused 1)
(setq beacon-blink-when-window-scrolls 1)
(setq beacon-blink-when-point-moves-vertically 1)
(setq beacon-blink-when-point-moves-horizontally 1)
(setq beacon-push-mark 35)

#+END_SRC




** Theme

#+BEGIN_SRC elisp :tangle yes
(setq doom-theme 'doom-city-lights)
#+END_SRC


the user can controls the frame opacity by adding the below line
#+begin_src elisp :tangle yes
 ;;(set-frame-parameter (selected-frame) 'alpha '(<active> . <inactive>))
 ;;(set-frame-parameter (selected-frame) 'alpha <both>)
 (set-frame-parameter (selected-frame) 'alpha '(85 . 50))
 (add-to-list 'default-frame-alist '(alpha . (85 . 50)))
#+end_src



*** Fonts
#+BEGIN_SRC elisp :tangle yes
(setq doom-font (font-spec :family "Fira Code" :size 19))
#+END_SRC



*** Line number
#+BEGIN_SRC elisp :tangle yes
(setq display-line-numbers-type 'relative)
#+END_SRC





** Org
*** Journal
#+begin_src emacs-lisp :tangle yes
(setq org-journal-dir "~/Dropbox/Logs/")
(setq org-journal-date-format "%A, %d %B %Y")
(require 'org-journal)
#+end_src
